[
  {
    "title": "Meghan Markle told 'she chose this life' as Lilibet 'written out of royal history'",
    "image": "",
    "date": " Tuesday Jul 26, 2022 ",
    "data": "Meghan Markle and Prince Harry are told to keep up with the consequences of leaving UK.As per a royal expert, the Sussexes are worried their younger offspring, Lilibet, will be written out of royal history.Neil Sean reveals on his YouTube channel: According to that good source, it appears that both Harry and Meghan feel that their daughter is going to be written out of history.Mr Sean explained: This is because if you think about it logically, when are they next going to return? When will the opportunity be there to have a formal portrait with our gracious monarch?Later, in a poll carried out by Express.co.uk, readers were asked if Lilibet should return to the UK to avoid being written out of royal history?Harry and Meghan wanted a life in the US with their family. That's what they have got, so why should their daughter come to the UK, responded one netizen.Even if they returned [to the UK] she would not be written into royal history, added another.A third commented: She is currently eighth in line. When the Queen passes she will temporarily move up a place but after that when the Cambridge children have their own children she will only ever go down."
  },
  {
    "title": "Matt LeBlanc reveals why he took six-year hiatus after Friends ended",
    "image": "",
    "date": " Tuesday Jul 26, 2022 ",
    "data": "Friends star Matt LeBlanc opened up about his six-year hiatus after the hit 90s' show ended.According to Express UK, Matt, who rose to fame with his much-loved character Joey Tribbiani in the popular show, became the highest paid sitcom actors in Hollywood, however, money wasnt everything for him.To note, Matt worked in the sitcom for 10 years and the following spin-off Joey for two more years without the support of his five co-stars. Reportedly, Joey was not a success and only lasted for two seasons, after which Matt noted he was completely burnt out.The outlet reported that the Ed actor retreated to his ranch in California in 2006 and stayed there for few years.Explaining about his action, Matt shared in other interview with The Mirror, I barely left the house. I wanted to not have a schedule, not be somewhere. I almost had a nervous breakdown.The actor also experienced personal trauma during this time as his youngest daughter was diagnosed with cortical dysplasia.Matt described it as a very dark period, along with his divorce in 2006.It was David Crane, Friends co-creator, who brought Matt out of hiatus in 2011 and offered him Episodes."
  },
  {
    "title": "Khloe Kardashian still loves Tristan Thompson: Fixed on redeeming him",
    "image": "",
    "date": " Tuesday Jul 26, 2022 ",
    "data": "Khloe Kardashian loves her ex-boyfriend Tristan Thompson even though he cheated on her with several women and also fathered a child while he was still in a relationship with the 38-year-old.The reality TV star still fixed on redeeming him which is why the Kardashians are still not shunning the NBA player.An insider spilled to Page Six, Im told that Khlo still loves Tristan, she is fixed on redeeming him, and nothing would shock me if they got back together again.This is really why the family is not shunning Tristan. Theyre standing by Khlo, of course. The Kardashians always stick together, the source noted.The Good American co-founder, who is expecting her second baby via surrogacy with the basketball player, reportedly planned her future with him before she discovered he has fathered a child with Maralee Nichols.Its just sad sometimes when you really want something to work, a friend of the family told the publication.Khlos very open about the fact that she knows her life is public and thats a choice she made  but still, its just hard to have this all play out in public, the statement added.Khloe and Tristan originally planned to announce the news of their second baby on The Kardashians season 2, but that was before the news of Tristan cheating and the breakup happened.Once it was determined that theyd be going through the pregnancy somewhat separately, word got out to too many people, the source continued.And they realized it was likely going to leak and that it would be hard to keep things secret before the September premiere, the outlet shared.Meanwhile, another source revealed, Khlo always wanted True to have a little brother, that was her dream. When she and Tristan created the embryos together, they were very much in love, and Khlo was excited for the future.Her friends were so upset about the Tristan drama, and then those who were really in the loop knew that it was even more complicated because they had a baby on the way, the insider said."
  },
  {
    "title": "Meghan Markles ex-husband Trevor Engelson follows in her footsteps",
    "image": "https://www.geo.tv/assets/uploads/updates/2022-07-26/429810_6956649_updates.jpg",
    "date": " Tuesday Jul 26, 2022 ",
    "data": "Duchess of Sussex Meghan Markles ex-husband Trevor Engelson and his wife Tracey Kurland followed in the footsteps of the former Suits actress and Prince Harry by helping a same grieving family.Meghan and Harry made a joint $5,000 donation to the fundraiser set up for the Zajfen family from Los Angeles, who lost their son George.The royal couple made the donation under the names of their children son Archie and daughter Lilibet.Meghans former husband Trevor and his wife also made a $1000 donation to the same family.Meghan Markle and Trevors similar act shows that they may have known the family during their relationship.According to the Daily Mail, it suggests they could be old friends."
  },
  {
    "title": "Jennifer Aniston soaks up the sun on sandy beach in black swimwear ",
    "image": "",
    "date": " Tuesday Jul 26, 2022 ",
    "data": "Jennifer Aniston looked gorgeous as ever while enjoying her summer on a sandy beach in latest social media post.Taking to Instagram, the Friends alum enthralled her fans as she dropped a selfie featuring her soaking up the sun on the beach.The Morning Showstar stunned in a black swimsuit with a large brim hat while her golden blonde locks fell down her shoulders in natural waves.A post shared by Jennifer Aniston (@jenniferaniston)Brad Pitts ex-wife flaunted her natural beauty with no-make up on and had her eyes covered with stylish shades.Captioning the photo, Aniston dropped emojis of a waving hand, the sun and a red heart to let her fans and 40.6 million followers know about her good mood.Previously, in an interview with Bustle, Aniston talked about the things that help her during the stressful and hectic schedules.My dogs. They have no care in the world except you, food, and to pee, and play with a ball. Its unconditional love, she revealed. Its so nice. That, and good friends and meditation. All of that is essential, especially these days, the actor added.She further emphasized on the importance of prioritizing work and life balance, Work is important and I love my work. I have so much fun, I work hard, but then when its time off, I really appreciate it.Im not a workaholic. I work to live, I dont live to work, Aniston added. "
  },
  {
    "title": "ITZY's mini-album 'Checkmate' clinches 8th spot on Billboard 200's top 10 ",
    "image": "",
    "date": " Tuesday Jul 26, 2022 ",
    "data": "ITZYs new mini album CHECKMATEsecured 8th spot on Billboard Top 200 Albums chart this week, making it one of the most popular albums in the United States.This is the first time ITZY has entered the top 10 on Billboard 200, marking their third entry as well on the chart overall with their 2021 albums GUESS WHO and CRAZY IN LOVE (the latter of which peaked at No. 11).The album achieved 2.96 million on-demand audio streams within a week of its release. The albums total score included 31000 album sales and 2000 streaming equivalent album (SEA) units.According to Luminate (formerly MRC Data), CHECKMATE earned a total of 33,000 equivalent album units during the week ending on July 21.Following BLACKPINK, TWICE, and Aespa, ITZY is the only fourth K-pop girl group in history to enter the top 10 of the Billboard 200.CHECKMATEis also only the fifth K-pop girl group album ever to pave its way into the top 10 after BLACKPINKs THE ALBUM, TWICEs Taste of Love and Formula of Love: O+T=, and Aespas Girls.Congratulations to ITZY for breaking the records!"
  },
  {
    "title": "BTS J-Hope's solo Jack in the Box lands 17th position on US Billboard",
    "image": "https://www.geo.tv/assets/uploads/updates/2022-07-26/429768_1197174_updates.jpg",
    "date": " Tuesday Jul 26, 2022 ",
    "data": "J-Hopes solo Jack in the Box climbed to 17th on US Billboards main album charts this week.BTSs rapper-dancer J-Hopes first formal solo Jack in the Box placed 17th on the Billboard 200.Jack in the Box having ten songs, Arson one of the two main tracks of the album, landed at 96th on the Hot 100 main singles chart.The album also topped iTunes' top albums charts in 49 countries across the globe, upon its release on July 15.J-Hope departed for US on Monday to perform at the annual Lollapalooza music festival at Grant Park in Chicago on July 31st.J-Hope is the first Korean artist to headline a major United States festival."
  },
  {
    "title": "Don't 'ridicule' judicial commission by 'contravening Constitution': Justice Isa to CJP",
    "image": "https://www.geo.tv/assets/uploads/updates/2022-07-26/429780_7313142_updates.jpg",
    "date": " Tuesday Jul 26, 2022 ",
    "data": "Senior most Judge of the Supreme Court Justice Qazi Faez Isa has written a letter to the Judicial Commission of Pakistan (JCP), seeking postponement of its meeting scheduled on July 28, 2022, for the appointment of Sindh and Lahore high courts judges to the apex court, a matter that requires utmost care and due deliberation as it is a matter of extreme delicacy.The justice has severely criticised Chief Justice Umar Ata Bandial for scheduling the meeting at such a time when he (Isa) is not able to physically attend the meeting as he is currently on leave abroad.He stated in the letter that while on annual leave, he received a WhatsApp message from the Additional Registrar of the Supreme Court that the CJ has called a meeting of the JCP on July 28 to consider appointing five judges to the SC. No meeting of the JCP was scheduled before I applied for the annual leave but as soon as I left Pakistan the CJ decided to hold two meetings of the JCP to consider appointments to the Sindh and Lahore High Courts, and now a third unscheduled meeting of the JCP is to be held during the summer vacations of the SC, Isa wrote.He said that the summer vacations of the SC were notified by the CJ himself and later gazetted in the Official Gazette. He said that if the CJ renders his own notification utterly meaningless then let him first withdraw it, instead of violating it.Moreover, he mentioned that he was referred to 2,347 pages of documents regarding the appointment of judges through WhatsApp. The CJ wants to rush through a most delicate matter in a very questionable manner. He wants 2,347 pages of documents to be examined in a week.He complained that he was unable to view all the pages as he could access and read only 14 out of 2,347 pages.[...] the documents have still not been couriered to me or sent to the Pakistan Embassy at Madrid for onward transmission to me, he said.Addressing the chief justice he said: CJ please do not ridicule the JCP and your nominees by contravening the Constitution. The JCP deserves to be treated with respect and consideration by its Chairman.Therefore, I request that the JCP meeting should be postponed. Instead, let us first meet to consider how to proceed further in the matter. And, if Chief Justice and senior puisne judges of the high courts are to be bypassed then to first develop for consideration of the JCP criteria for nominees, since the then senior most judge failed to accomplish the task assigned to him, Justice Isa wrote.He also demanded an end to the practice of giving the JCP pre-selected names to consider for the judges' appointments.Restricting the JCP to consider only the CJ's pre-selected nominees is inappropriate. The JCP deserves to be treated with respect and consideration by its Chairman, Justice Isa said.Justice Isa had raised objections to the calling of two Judicial Commission of Pakistan (JCP) meetings for the appointment of new judges in his absence earlier as well.It seems that more care in the appointment of a cook is exercised than in the appointment of judges, the justice said in a WhatsApp message to Chief Justice Umar Ata Bandial, which was also addressed to the members of the council.Justice Isa said he learnt, through the media that two meetings of the JCP have been called on June 28 and 29, respectively, to consider the nominees."
  },
  {
    "title": "Pakistani rupee continues to sink against US dollar as political crisis deepens",
    "image": "https://www.geo.tv/assets/uploads/updates/2022-07-26/429775_911084_updates.jpg",
    "date": " Tuesday Jul 26, 2022 ",
    "data": " KARACHI: The Pakistani rupee continued Tuesday to lose ground against the US dollar and hit a new low during intraday trade in the interbank market, keeping the financial market jittery amid an ongoing political crisis.The local unit is trading in the interbank market at 233, up from 229.88 a day earlier.The rupee has been one of the worlds worst-performing currencies, slumping 30.2% since the start of the year (2022), The News reported.Tahir Abbas, the head of research at Arif Habib Limited, said: Shortage of dollars, political and economic uncertainty tagged with ambiguity regarding commitment from friendly countries, which is needed for disbursement of IMF tranche were the reasons behind rupees persistent slide.Fears have risen about Pakistan's stuttering economy as its currency fell nearly 8% against the US dollar in the last trading week, while the country's forex reserves stand below $10 billion with inflation at the highest in more than a decade.Alpha Beta Core CEO Khurram Schezad told Geo.tv that the dollar is getting stronger in the global market almost against all the world currencies  and the rupee is not an exception.In addition, he said, Pakistan's external account issues are not settled as yet though imports are slowing.He noted that although the International Monetary Fund is on board for disbursement, the flows are yet to materialise as the Executive Board's final approval is awaited.Global rating agencies have put a negative outlook on the economy, so that is an additional burden that is weighing in on the financial markets in general and forex market in particular, he added.Muhammad Saad Ali, a capital market expert, told Geo.tv that the rise in political uncertainty  of whether the present government will remain in office long enough to stabilise the economy and the continued confusion around who governs the Punjab province  is causing the rupee to slip.Note that balance of payments pressure on the currency have eased, as per the central bank, which asserts that Pakistan has enough capital commitments for the next 12 months to take care of its dollar outflows, he said.I reiterate political uncertainty is weakening market sentiment and leading to more rupee depreciation, Ali added."
  },
  {
    "title": "Prince Andrew climbing on the shoulders of Beatrice, Eugenie for royal return",
    "image": "",
    "date": " Tuesday Jul 26, 2022 ",
    "data": "Prince Andrew wants to make return to royal life through his daughters Princess Beatrice and Eugenie.Royal commentator Neil Sean on his YouTube channel said: Andrew wants to make a return which he thinks could be achieved by his daughters carrying out charitable work.Mr Sean also adds how the sisters are hurt by cousin Prince William and uncle Prince Charles handling the banishment of their father.According to very good sources, Princesses Eugenie and Beatrice are seemingly struggling to remain cordial with Prince William, Catherine, and Charles.It stems from the deal organized by William, the Queen, and Prince Charles to remove their father Prince Andrew from royal duties following his disgrace in recent years.The thawing between the two families has been difficult.Prince William and Charles are doing this for the benefit of the monarchy.They are reading the public mood, which is saying that Andrew should permanently retire from public life."
  },
  {
    "title": "Lynne Spears pens comforting note for Britney after she posts alleged texts from 2019",
    "image": "https://www.geo.tv/assets/uploads/updates/2022-07-26/429801_2316050_updates.jpg",
    "date": " Tuesday Jul 26, 2022 ",
    "data": "Pop icon Britney Spears mother Lynne Spears turned to her social media handle to address her daughters alleged claims and conversations during her 2019 stay at a mental health facility. The American author, 67, reacted to the string of screenshots shared by the Gimme More crooner in a now-deleted post, describing that her mom, friend, and lawyer didnt respond to her text messages.On Monday, Lynne captioned a screenshot of texts that Britneys friend, Jansen Fitzgerald, posted to her Instagram Story to show that she did respond to the pop star and wrote, Britney, I have the whole conversations as well!A post shared by Lynne Spears (@lynnespears_rf)She continued, I hurt for you that you feel the people who love you the most betrayed you! Let me come to you! I love you! Although, Lynne did not share her own alleged responses to her daughters desperate texts.In the messages Britney, 41, sent Fitzgerald  whom she claimed she never heard back from  she asked for help finding a new lawyer (her attorney at the time, Samuel D. Ingham III, was court-appointed) and also expressed concern over the drug lithium, which she claimed to have been administered against her will under her conservatorship.Fitzgerald accompanied the screenshot with text that read, I did respond!! I have always felt like some of my messages were deleted.She also claimed that she had a feeling Britneys phone was being monitored, so they tried to be cautious about their responses in text messages."
  },
  {
    "title": "Elon Musk hints at moving away from spotlight",
    "image": "https://www.geo.tv/assets/uploads/updates/2022-07-26/429794_6083500_updates.jpg",
    "date": " Tuesday Jul 26, 2022 ",
    "data": "Tesla chief Elon Musk has hinted that he wants to move away from the spotlight as trivial matters related to him generate a lot of chatter.The amount of attention on me has gone supernova, which super sucks, the billionaire tweeted after he was in focus following rumours of him ending his friendship with Google co-founder Sergey Brin.Unfortunately, even trivial articles about me generate a lot of clicks, he said, while adding a sad face to the text.Musk added that he will try his best to put his head down and focus on doing useful things for civilisation.Musk rubbished rumours of him ending his friendship with Brin, clapping back at talk of an affair with Brins wife, Nicole Shanahan.Sergey and I are friends and were at a party together last night! Musk wrote on Twitter.Terming his relationship with Nicole as nothing romantic, Musk said that he met her twice in three years and that too in public."
  },
  {
    "title": "In political matters, do Supreme Court benches change or stay the same?",
    "image": "https://www.geo.tv/assets/uploads/updates/2022-07-26/429792_9692152_updates.jpg",
    "date": " Tuesday Jul 26, 2022 ",
    "data": "In a thunderous press conference on Monday, the vice president of the Pakistan Muslim League-N, Maryam Nawaz Sharif, accused the top court of bench-fixing, implying that the same judges sit on the bench when the Supreme Court of Pakistan is hearing cases of political importance.Other leaders of the Pakistan Democratic Movement, seated with Maryam, went as far as to demand that the court dispel this impression by hearing the present case, regarding the election of the chief minister of Punjab, by constituting a full-court bench. The demand has been rejected by a three-member bench of the apex court.But is the allegation correct? Does the panel of judges, which rules on political matters, follow a pattern?Geo.tv has compiled a list of some major court cases, which involved political parties, from 2017 to date, in no particular order:Bench: Justice Umar Ata Bandial, Justice Ijaz ul Ahsan, Justice Jamal Khan MandokhailVerdict: Run-off election on July 22, ignoring the LHC judgementBench: Justice Umar Ata Bandial, Justice Ijaz ul Ahsan, Justice Munib AkhtarVerdict: Decision awaitedBench: Justice Umar Ata Bandial, Justice Ijaz ul Ahsan, Justice Munib Akhtar, Justice Mazhar Alam Khan Miankhel, Justice Jamal Khan MandokhailVerdict: Deputy Speaker Qasim Suris ruling unconstitutional, National Assembly restoredBench: Justice Umar Ata Bandial, Justice Ijaz ul Ahsan, Justice Mazhar Alam Khan Miankhel, Justice Munib Akhtar, Justice Jamal Khan MandokhailVerdict: A divided court (3-2) ruled that votes of defected lawmakers not be countedBench: Justice Umar Ata Bandial, Justice Ijaz ul Ahsan, Justice Mansoor Ali ShahVerdict: Decision awaitedBench: Justices Asif Saeed Khan Khosa, Justice Ijaz ul Ahsan, Justice Ejaz Afzal Khan, Justice Gulzar Ahmed, Justice Azmat SaeedVerdict: Decided to form a Joint Investigation Team to probe corruption allegation against Prime Minister Nawaz SharifBench: Justice Ejaz Afzal Khan, Justice Azmat Saeed, Justice Ijaz ul AhsanVerdict: Prime Minister Nawaz Sharif removed from officeBench: Justice Saqib Nisar, Justice Azmat Saeed, Justice Umar Ata Bandial, Justice Ijaz-ul-Ahsan, Justice Sajjad Ali ShahVerdict: Lifetime ban on Nawaz Sharif, Jahangir TareenBench: Justice Saqib Nisar, Justice Umar Ata Bandial, Justice Faisal ArabVerdict: Money trail provided by Imran Khan sufficient, while Jahangir Tareen declared dishonestBench: Justice Saqib Nisar, Justice Umar Ata Bandial, Justice Ijaz ul AhsanVerdict: DismissedBench: Justice Umar Ata Bandial, Justice Faisal Arab, Justice Ijaz ul AhsanVerdict: Suri reinstated as deputy speaker of National Assembly despite ECP orderBench: Justice Ijaz ul Ahsan, Justice Munib Akhtar, Justice Mazahar Ali NaqviVerdict: PTI provided ground to protestBench: Justice Asif Khosa, Justice Sajjad Ali Shah, Justice Yahya AfridiVerdict: Nawaz Sharif granted bail on medical reasons"
  },
  {
    "title": "CJP invites all parties in CM Punjab election case to assist court in reaching fair decision",
    "image": "",
    "date": " Tuesday Jul 26, 2022 ",
    "data": "ISLAMABAD: The Supreme Court of Pakistan Tuesday resumed hearing the case of the Punjab chief minister's election  where Hamza Shahbaz defeated Pervez Elahi  for the third day.During the hearing, Punjab Assembly Deputy Speaker Dost Mazari's lawyer Irfan Qadir and PPP lawyer Farooq H Naek told the court that they will not be participating in the hearing as a boycott is being observed.Chief Justice Umar Ata Bandial then extended an open invitation to all the parties to assist the court in reaching a fair and just decision in the high-profile case.Elahi, who had been defeated on July 22 after 10 PML-Q votes were rejected by Deputy Speaker Punjab Assembly Dost Mazari, had challenged the ruling in the SC.The SC formed a three-member bench to hear the case, but the coalition government objected to it and demanded a full court take up the matter.However, after hearing arguments from all sides for nearly eight hours on Monday, the SC decided not to form a full court bench, saying that the same bench would hear the case.As the SC decided not to form a full bench, the ruling coalition and the Pakistan Democratic Movement (PDM) decided to boycott the apex court's hearing.Qadir told the bench that his client had told him to not be a part of the proceedings as a country-wide boycott of the judiciary is being observed.Qadir told the SC that he would challenge the apex court's decision relating to the full court  wherein the top court decided to not form a full bench to hear the case.Following Qadir, PPP lawyer Farooq H Naek came to the rostrum and informed the CJP that he would not be part of the proceedings.At this, the CJP told him that he is not a party in the case.The CJP said that no legal grounds were presented before the court; arguments were presented only regarding the party head's directions; the court arrived at the conclusion that in the current case, there was no need for a full bench.I will change my opinion only when concrete reasons are given.CJP Bandial said the real question was who could give directions to party lawmakers. The constitution clearly states that the parliamentary party will give directions to MPs, he said.There is no need for further arguments in this case. We will give priority to wrapping up this case as soon as possible, he said.CJP Bandial said that forming a full court was tantamount to unnecessary delay.The formation of a full court and then hearing of the case could have been delayed till September as leaves are being taken in the court.Meanwhile, the top court sought assistance on the matter relating to directions by the party head or a parliamentary party.Assist the court over the legal questions or we will set ourselves aside from the bench, CJP Bandial told Barrister Ali Zafar, the counsel of Elahi.People sitting on my right side have unanimously decided to boycott the proceedings of the court, he said, adding that thankfully, they have enough grace to sit in court to hear the proceedings.Giving his arguments in the case, Zafar said that the petitions against the 21st Amendment were dismissed by a ratio of 13:4 in a full court.However, many judges gave different reasons for dismissing the petitions, he added.Zafar told the court that the constitution mentions that the parliamentary party will give directions to the lawmakers about voting.At this, the CJP questioned whether the party head and parliamentary party were two separate entities.Zafar said that they were two separate entities.CJP Bandial said that the parliamentary party does not may its decision on its own. In light of the political partys directions, the parliamentary party makes its decision.Justice Ahsan then said, according to the constitution, the party head follows the parliamentary party's directions. The CJP said that the parliamentary party does not make a decision unilaterally.The parliamentary party is informed about the party's decision, and based on that, it takes a decision.During the proceedings, Justice Ahsan questioned: Where has the word parliamentary leader been used?The PML-Q counsel replied that the world parliamentary party is used in the Political Parties Order 2002.At this, Justice Ahsan remarked that the word parliamentary leader instead of parliamentary party is just a mistake.Additional Attorney-General (AAG) Amir Rehman then came to the rostrum and said he wanted to present a few suggestions before the court.Has the federal government decided to separate itself from the coalition government? the CJP asked.The AAG told the top judge that he will assist the court under Article 27.At this, the CJP extended an open invitation to assist the court to reach a fair and just decision in the high-profile case.The court then went on a break for an hour and said that the hearing will resume at 2:30pm.While addressing PPP lawyer Naek  who is not participating in the case due to the boycott  Justice Ahsan asked him to give his arguments if some betterment can be made in the case.The issue is, in these cases were are bound by party policy. Although, I was ready to assist the court, he told Justice Ahsan.Minutes before the proceedings of the case started, PTI senior leader Fawad Chaudhry said the government preferred to run away from the case as it does not have arguments to support its claim.Criticising the ruling coalition, the PTI leader said: The government does not recognise the Supreme Court of Pakistan.Hailing the SC decision on the demand for a full court bench in the Punjab CM election case, the PTI leader said: Such cases are heard only by senior judges across the world.Following the Punjab by-election results, Hamza should have tendered his resignation as Punjab CM, he said, adding that they should have corrected their mistakes and the political leadership in the province.The ex-information minister said that democracy thrives when a person who has lost accepts their defeat, slamming the Pakistan Democratic Movement (PDM) for its unacceptable attitude towards the SC.Dozens of times, bar associations have condemned such acts [...] the PDM should accept the people's decisions. This case shouldn't have come here; don't place political burden on the SC, he said.Fawad called for the judiciary to be given the freedom to function independently and highlighted that the CJP cannot be dictated.More to follow..."
  },
  {
    "title": "Harry told to focus more on US security after intrusion: 'Don't complain about UK'",
    "image": "https://www.geo.tv/assets/uploads/updates/2022-07-26/429796_2630662_updates.jpg",
    "date": " Tuesday Jul 26, 2022 ",
    "data": "Prince Harry and wife Meghan Markle have been alarmed about a potential security breach in their Montecito mansion in California.The Duke's security has identified two intruder alerts in the past one week under 'suspicious circumstances'.Meanwhile, royal author Angela Levin insisted Harry wouldnt have that problem if he was based in Britain.Ms Levin tweeted: I bet he wouldn't have that problem in the UK.Both calls were logged as trespasser and property crimesMs Levin told The Sun: Maybe Harry should concentrate more on the security in California rather than making complaints about his security in Britain.After two intruder alerts in 12 days, surely he should be making the protection of his family in the US his priority.Officers attended intruder alerts on May 19 and May 31."
  },
  {
    "title": "Britney Spears is officially back!: Singer records Tiny Dancer duet with Elton John ",
    "image": "",
    "date": " Tuesday Jul 26, 2022 ",
    "data": "Britney Spears to finally make her musical comeback after her 13-year-long conservatorship termination as she collaborates with singer Elton John.The duo reportedly met at a Beverly Hills recording studio last week to record a new version of the 1971 hit Tiny Dancer.This was Eltons idea, and Britney is a huge fan. They have recorded a remix of Tiny Dancer as a full duet  and it is incredible, an insider told Page Six.Britney was in the studio in Beverly Hills last week with Elton for the super-secret recording session overseen by uber-producer Andrew Watt, the source revealed.Watt has previously worked with Justin Bieber, Miley Cyrus, Pearl Jam and Ozzy Osbourne and also won the 2021 Grammy Award for Producer of the Year.Theyve already played it for people at their record label, and everybody is freaking out. It is so good, the source continued. They are saying this is going to be the song of the summer.Britney is officially back. Shes back to work, and shes super excited, the insider said.The insider further disclosed that the comeback song of the Toxic hit-maker is slated to be released next month by Universal Music."
  },
  {
    "title": "Meghan Markle snubbed Queen invite to take Archie for solo holiday",
    "image": "",
    "date": " Tuesday Jul 26, 2022 ",
    "data": "Meghan Markle and Prince Harry decided to turn down Queen's invitation in 2019 to spend family time with Archie.The family-of-three jetted off to Ibiza while the monarch spent the summer holidays in Balmoral.Author Tom Bower claimed Harry and Meghan felt Archie was too young at three months to travel by plane to Scotland.Despite the earlier snub, it has been reported that Queen has again extended an invite to the Sussexes to join her for summer retreat- an offer rejected by the couple amid their busy schedule, it is conjectured.The couple's last visit to UK was marked in June, where they also introduced their younger child, Lilibet, to the Queen during her Platinum Jubilee celebrations."
  },
  {
    "title": "Joni Mitchell delivers her first full set in more than 20 years",
    "image": "https://www.geo.tv/assets/uploads/updates/2022-07-26/429791_2433125_updates.jpg",
    "date": " Tuesday Jul 26, 2022 ",
    "data": "New York: Joni Mitchell delivered her first full set in more than 20 years this weekend, surprising attendees at the Newport Folk Festival alongside country star Brandi Carlile.The show followed Mitchells stage cameo earlier this year, when she joined other artists as they performed a moving tribute to her lifes work at the MusiCares pre-Grammy gala.Both moments marked rare public appearances for the trailblazing Mitchell, who in 2015 suffered a brain aneurysm that left her temporarily unable to speak, the aftermath of which has involved extensive physical therapy.Mitchell and Carlile sang duets including the 78-year-olds A Case of You and Both Sides Now, while the Canadian-born folk icon delighted the crowd by playing the lengthy solo from Just Like This Train on an electric guitar.Mitchell last appeared at Newport, an annual festival in Rhode Island, in 1969.Sundays 13-song set also featured her classic environmentalist anthem Big Yellow Taxi and The Circle Game along with renditions of Summertime, Love Potion No. 9 and Why Do Fools Fall in Love.The revolutionary singer-songwriter earlier this year was honored as MusiCares Person of the Year at the charity gala that precedes the Grammys, where she gave a brief performance.The next night she accepted the Grammy for Best Historical Album, appearing in a red leather beret, sunglasses and floral pants, her flowing blonde hair in pigtails.Born in a small town in western Canada, Mitchell had her start playing small clubs and eventually moved to Los Angeles, where she became a pivotal figure in the 1960s Laurel Canyon music scene and beyond.She is considered one of her generations most iconic singer-songwriters, giving rise to the phenomenon of the solitary and thoughtful musician who pours out emotion on stage.Last summer her seminal album Blue charted number one on iTunes as it hit its fiftieth anniversary -- outperforming even pop sensation Olivia Rodrigos Sour.Voicing her own astonishment over the milestone on the MusiCares red carpet, Mitchell earlier this year explained her albums enduring popularity and recent resurgence: Maybe people want to get a little bit deeper."
  },
  {
    "title": "Meghan Markle is 'creature of Hollywood', she knows 'social media' will pay her bills",
    "image": "https://www.geo.tv/assets/uploads/updates/2022-07-26/429786_8216904_updates.jpg",
    "date": " Tuesday Jul 26, 2022 ",
    "data": "Meghan Markle has a social media army protecting her from negative hearsay.Speaking to GB News, author Tom Bower shared how Meghan is in full 'control' of what is said about her on the internet.Mr Bower said: I'm on social media, so I had the pleasure of reading their vitriol. Of course, she does. Meghan is a person who owns the narrative, that being part of the problem.I mean, she came to London to be part of the royal family. She couldn't understand what she was and most importantly, she wasn't in control of everything. And that's why of course, she had fractious relationships with so many people.He added: So, I'm convinced she has a very talented staff, they're hard-working. They know how important the brand market is. And they will be keeping in touch with what is being said.And with everything that's being said, because however much people pay attention to my book, there are many people, I'm told, that love the book and the book is now number one best-seller. So, that can't be of much pleasure to Meghan. So, I think she is very much in control of what is being said and she's utterly passionate about her image. I mean, that is the thing that matters. She's a creature of Hollywood. She knows that celebrity images are what earns them money.That's what she must protect, Tim Bower said."
  },
  {
    "title": "Queen allowed Sarah Ferguson to keep her wedding tiara BUT not Meghan Markle",
    "image": "https://www.geo.tv/assets/uploads/updates/2022-07-26/429760_8524932_updates.jpg",
    "date": " Tuesday Jul 26, 2022 ",
    "data": "Queen allowed Prince Andrew's wife, Sarah Ferguson, to keep her wedding tiara unlike Meghan Markle and Kate Middleton.As per royal tradition, the monarch lends royal brides jewels from family vaults for the bid day.For Sarah, however, Queen made a special call. Fergie entered the wedding hall and shocked admirers in a plain flower tiara.During the wedding ceremony, she then surprised everybody as she exchanged her flower headpiece with a diamond one.Known as the York Diamond Tiara, the stunning headpiece was commissioned by the Queen, especially for the wedding. Sarah could thus keep the piece after the wedding.On the contrary, Meghan and Kate got their tiaras from the royal collection and so had to return them after walking down the aisle."
  },
  {
    "title": "Pakistan borrows $22.5bn in FY22 to prevent depleting foreign reserves",
    "image": "https://www.geo.tv/assets/uploads/updates/2022-07-26/429753_1391136_updates.jpg",
    "date": " Tuesday Jul 26, 2022 ",
    "data": "Pakistan hasobtained total foreign loans of $22.5 billion in fiscal year 2021-22, including highly expensive $2.24 billion commercial loans just last month (June 2022) to avoid rapid depletion of foreign currency reserves.Due to the government's inability to restart the IMF programme, Islamabad was unable to obtain budgetary/policy loans from multilateral creditors and had to rely on loan disbursements for project financing. In such a case, the government would have to rely on commercial loans, bilateral deposits, the issuance of international bonds, and guaranteed loans to bridge the financing gaps.However, the external debt repayments and increased imports bill resulted in depleting of foreign currency reserves and the foreign exchange reserves declined from $20 billion to below $10 billion till June 30, 2022. Till July 15, 2022, the foreign exchange reserves had further declined to $9.3 billion, The News reported.In bilateral lenders, Saudi Arabia has become the largest lender in the last fiscal year and provided over $400 million in FY2022.The Economic Affairs Division (EAD) data showed the government received total loans and grants of $17 billion ($16.98 billion exactly) in the last fiscal year 2021-22 ended on June 30, 2022 against $14.2 billion received in the previous fiscal year 2020-21.However, according to the State Bank of Pakistan (SBP) data, they received $4.606 billion in Roshan Digital Accounts out of which $2.9 billion were received for Naya Pakistan Certificate till June 22, 2022. Pakistan also received $1 billion tranche from the IMF after completion of the 6th Review under the $6 billion Extended Fund Facility (EFF) in February 2022.According to the official data released by EAD, Islamabad received $4.8 billion from multilateral creditors during the last fiscal year out of which the Asian Development Bank (ADB) disbursed a loan of $1.62 billion. The Asian Infrastructure Investment Bank (AIIB) disbursed $41.6 million, ECOT/Bank $52.3 million, European Union (EU) $22.55 million, World Banks IBRD $259.6 million, WBs IDA $1.32 billion, Islamic Development Bank (IDB) $78 million, Islamic Development Bank (short-term) $1.327 billion, IFAD $43.13 million, Japan $0.55 million, MDTF $6.1 million and OFID $50 million.The bilateral donors provided $708 million to Pakistan in the last fiscal year as China disbursed $162.6 million, France $15.5 million, Germany $16.68 million, Japan $20 million, Korea $5.51 million, Kuwait $0.11 million, Oman $0.75 million, Saudi Arabia $401.09 million, UK $16.01 million and USA $69.82 million.The multilateral and bilateral creditors had provided $5.536 billion during the last financial year 2021-22.The government generated $2.04 billion through international bonds in the last fiscal year. The last PTI led regime had launched both Eurobond and Sukuk bond for raising dollar inflows.Through commercial loans, the government raised $4.863 billion in the last fiscal year out of which $2.24 billion were generated alone in June 2022. It seemed that Islamabad was left with no other options but to generate dollar inflows through this easy mode of raising dollars at a time when the foreign exchange reserves were declining at a rapid pace.The government received time deposits of $3 billion in the current fiscal year from Saudi Arabia. The government also generated $1.532 billion in the shape of guaranteed loans in the last financial year."
  },
  {
    "title": "Chris Rock says it loud and clear, I am 'not a victim' after Will Smiths slap",
    "image": "https://www.geo.tv/assets/uploads/updates/2022-07-26/429785_4404294_updates.jpg",
    "date": " Tuesday Jul 26, 2022 ",
    "data": "Chris Rock is looking at the funny side of one of the biggest controversies of this year.The 57-year-old comedian, who is currently headlining a show with Kevin Hart, addressed the shocking scandal where Will Smith shockingly slapped him at Oscars 2022 and said he is not a victim.During his stand-up show, while talking about cancel culture, Rock joked, Anyone who says words hurt has never been punched in the face, as revealed by an insider to US Weekly. He also referenced the 53-year-old actor as Suge Smith, which could possibly be linked to the currently-incarcerated Death Row Records CEO Suge Knight.Later, during a sketch about people playing the victim and being overly sensitive, Rock said, I'm not a victim [expletive], and joked he had shook that [expletive] off and went to work the next day a I don't go to the hospital for a papercut.The Pursuit of Happyness actor slapped Rock after he made a joke about his wife Jada Pinkett Smith's bald head, amid the actress' alopecia diagnosis.This led to the Oscar winner storming the stage and hitting Rock, and eventually abusing him, Keep my wife's name out your [expletive] mouth.Smith, who has been married to Jada since 1997, previously described his behavior at the Oscars as shocking, painful, and inexcusable. As a result of his actions, the 'Men in Black' actor resigned from the Academy after issuing an apology."
  },
  {
    "title": "Pak vs SL: Ramesh stars as Sri Lanka bowl out Pakistan for 231 to extend lead",
    "image": "",
    "date": " Tuesday Jul 26, 2022 ",
    "data": " GALLE: Spinner Ramesh Mendis took five wickets to help bowl out Pakistan for 231 on Tuesday as Sri Lanka increased their lead to 169 on day three of the second Test.The hosts had reached 22 at lunch in Galle for their second innings with openers wicketkeeper-batsman Niroshan Dickwella, on 11, and Oshada Fernando, on eight, at the crease.The left-handed Dickwella opened Sri Lanka's batting with skipper Dimuth Karunaratne sitting out due to a lower back injury. The captain did not take the field in the Pakistan innings and will only bat if needed.Pakistan's innings ended in the morning session after the tourists resumed the day on 191-7, in reply to Sri Lanka's first innings of 378.Overnight batsman Yasir Shah resisted the bowling attack in a 32-run partnership with Hasan Ali, the pair batting for almost an hour before Prabath Jayasuriya broke through.Jayasuriya, a left-arm spinner who took 21 wickets in his first two Tests, bowled Hasan for 21 at the stroke of the first drinks break. He returned with three wickets.Off-spinner Ramesh sent back Nauman Ali and then trapped Yasir lbw for 26 to record a third five-wicket haul in his 10th Test to wrap up the innings.Agha Salman remained Pakistan's top scorer with his fighting 62 on Monday.Pakistan lead the two-match series 1-0."
  },
  {
    "title": "Goodfellas and Law & Order actor Paul Sorvino dies at 83",
    "image": "https://www.geo.tv/assets/uploads/updates/2022-07-26/429784_2978452_updates.jpg",
    "date": " Tuesday Jul 26, 2022 ",
    "data": "LOS ANGELES: Paul Sorvino, who played the role of gangster Paulie Cicero in classic mob movie Goodfellas, has died at the age of 83, a spokesperson for the actor said.Sorvino, also known for portraying police sergeant Phil Cerreta on TV series Law & Order in the 1990s, worked in film and television and on stage for more than 50 years.He died at the Mayo Clinic in Jacksonville, Florida, of natural causes, the spokesperson said.I am completely devastated. The love of my life & the most wonderful man who has ever lived is gone. I am heartbroken, his wife, Dee Dee Sorvino, wrote on Twitter.Born in Brooklyn in 1939, Sorvino studied music and originally wanted to become an opera singer before he turned to acting.His long career included roles in Broadway play That Championship Season and a 1982 film adaptation. Other movie credits included Dick Tracy, Reds and Nixon, in which he played Secretary of State Henry Kissinger.Martin Scorsese tapped Sorvino at age 50 to play Cicero, a quiet but formidable character based on the real-life mobster Paul Vario, in 1990's Goodfellas.Sorvino had three children, including actor Mira Sorvino, who thanked her father when she accepted her Academy Award for 1995 film Mighty Aphrodite.He has taught me everything I know about acting, she said at the time as he looked on from the audience and broke into tears.On Monday, Mira Sorvino said my heart is rent asunder by her father's death.A life of love and joy and wisdom with him is over, she wrote on Twitter. He was the most wonderful father. I love him so much. Im sending you love in the stars Dad as you ascend."
  },
  {
    "title": "Victoria Beckham shares sweet tribute for parents on 51st marriage anniversary",
    "image": "https://www.geo.tv/assets/uploads/updates/2022-07-26/429778_617278_updates.jpg",
    "date": " Tuesday Jul 26, 2022 ",
    "data": "Victoria Beckham celebrated her parents Jackie and Anthony Adams 51st wedding anniversary with a sweet tribute.Taking to Instagram, the former Spice Girls dropped snaps of the couple with a heartwarming note for them.Happy anniversary!! 51 years!! We love you both so much!!!, David Beckhams ladylove captioned the photos.Your marriage is an inspiration to us every day, Victoria added.The first photograph featured the couple from the back side while they stood in front of a gorgeous lake whereas the second showed them posing for the photo at a dinner table. A post shared by Victoria Beckham (@victoriabeckham)Thank you!!! Im sure your marriage is also an inspiration to lots of people, the fashion designers mother responded in the comment section.Love you all so so much. Have a fantastic holiday. Xxx she added.Victorias son Romeo Beckham also dropped some hearts for his grandparents while David shared two images of the couple on his stories on the photo sharing app. We love you, the sports star captioned the first photo. Happy anniversary. 51 years today."
  },
  {
    "title": "Pakistan among countries hit by world's worst heatwaves",
    "image": "https://www.geo.tv/assets/uploads/updates/2022-07-26/429771_9394358_updates.jpg",
    "date": " Tuesday Jul 26, 2022 ",
    "data": "A brutal heatwave is currently baking countries around the globe. Last week, the UK recorded the hottest day ever, with temperatures at London Heathrow Airport reaching 40 degrees Celsius (104 degrees Fahrenheit). Much of Central Asia and South Asia has experienced temperatures that are 20 degrees higher than average. National Weather Service heat advisories and warnings were extended in Texas last week, a day after triple-digit temperatures swept across the US.Also read:Explainer: What causes heatwaves?In Pakistan, too, temperatures have risen several degrees over the years.According to a TRT Worldinfographic, in 2015, Pakistan was one of the worst-affected countries with temperatures reaching 45 degrees Celsius and more than 1,300 people killed.In 2019, the heatwave claimed the lives of 56,000 people in Russia, according to the infographic, making it the worst in recent history.In 2003, temperatures in Europe reached 35-40C, resulting in more than 30,000 deaths.Back in 1901, more than 10,000 people died in the United States when the temperature reached 40C (104 degrees Fahrenheit).In 2015, temperatures in India reached 45C, resulting in 2,500 deaths.With temperatures soaring to 40C, Greece's 1987 heatwave was the deadliest in Europe, killing 1,300 people."
  },
  {
    "title": "Rising dollar: 10 reasons why you should be paying attention",
    "image": "https://www.geo.tv/assets/uploads/updates/2022-07-26/429772_2065816_updates.jpg",
    "date": " Tuesday Jul 26, 2022 ",
    "data": "FRANKFURT: All things to all people, the US dollar leaves its imprint in every corner of the global economy: It is the currency in which vital raw materials are bought and sold, and it is the safe haven to which investors turn in times of trouble.The greenback is now at a 20-year high against other world currencies, thanks in part to expectations that the Federal Reserve will increase its interest rates faster than most.Here are 10 reasons why you should be paying attention:A strong dollar is great if you are a US tourist. Hotels, meals or a designer bag all are cheaper by comparison, whether in London, the French Riviera or Cancun. It goes without saying that the reverse is true for the traveller going to the United States  unless they bought their Disneyland tickets or Las Vegas junket a good while ago, it is going to cost more.This is a welcome added boon for Americans travelling to one of the 19 countries that use the euro and a small consolation for European tourists in the United States. No more mental arithmetic is required to convert between dollars and euros  you can call it pretty much one for one now.For shoppers around the world in search of top US brands, the strong dollar means they could end up paying a premium for them unless local distributors try to cushion the currency impact. Just in the past days, US companies such as Mattel Inc  maker of the Barbie doll and Hot Wheels cars  said it was seeing a hit from the dollars move upwards, even if consumers as a whole looked ready to take on higher prices. For consumer goods giant Procter & Gamble  maker of everyday products such as Pampers or Ariel  the dollar's rise has always tended to have a similar impact on its sales. For Argentines, the rise of the dollar against the peso has meant a doubling of local prices in just one year and a spiralling economic crisis. Governments and businesses in a lot of emerging economies finance themselves by issuing bonds in US dollars. The amount they owe has now surged in value when measured in their local currency. Tapping the market for more credit has also become more expensive because US rates have risen.Countries like Turkey and Egypt that import a lot of their raw materials have been hit by a double whammy. Most commodities from oil to wheat are priced in US dollars, meaning they are paying more in their local currency for every barrel or bushel they buy. This comes as the price of many of those materials is already at a multi-year high due to the war in Ukraine, extreme weather and the aftershock of the COVID pandemic.A strong dollar is good news for people in poorer countries such as Mexico and Guatemala who depend on money sent by relatives who work in the United States. The COVID-19 fallout dealt a sharp blow to these remittances in 2020 but they've seen a steady recovery since.Even for richer countries such as Germany a strong dollar can spell trouble because it helps fuel already record-high inflation through more expensive imports. Local central banks have generally responded by raising interest rates, which makes credit dearer and slows economic growth.The Russian rouble is the only currency in the world that is comfortably in the black against the dollar this year  an unexpected outcome for a country under international sanctions over its invasion of Ukraine. But this strength  a somewhat artificial result of controls on foreign exchange  does little for the ordinary Russian. Moscow may be raking in tens of billions of dollars every month from its energy sales to the West, but Russian households still can't withdraw their foreign-currency savings. And Many Western brands from Adidas to H&M and Ikea have stopped selling in Russia since the war started.Marketed as the ultimate shield against inflation, the world's largest crypto currency hasn't lived up to its promise and is down by more than half this year despite runaway consumer prices in large parts of the world. Legions of individual investors drawn to crypto during last year's bull market have now ditched the digital tokens to park their savings in a US currency they perceive as safer  and which is now starting to pay interest again.If the price of a hamburger is anything to go by, the dollar might actually be too strong and bound to fall back. The Economist's Big Mac Index, which compares the price of the ubiquitous burger around the world, shows that the greenback is overvalued against all but a handful of currencies. The dollar is the most expensive  and a Big Mac cheapest for a US traveller  in Venezuela, Romania and Indonesia. The opposite is true in Switzerland, Norway and Uruguay."
  },
  {
    "title": "Digital ID card locks out millions in Pakistan",
    "image": "https://www.geo.tv/assets/uploads/updates/2022-07-26/429770_9164546_updates.jpg",
    "date": " Tuesday Jul 26, 2022 ",
    "data": "After three years of repeated attempts to get her digital national identity card, Rubina - a woman from the Pakistani city of Karachi - decided to take her battle to court, winning a landmark victory.Until then, Pakistanis had not been able to get the Computerized National Identity Card (CNIC) unless they presented their father's ID card - an impossibility for many people, including those like Rubina who were raised by single mothers.The card is vital to vote, access government benefits including public schools and healthcare, open a bank account or apply for jobs.I would turn up there, and be told to bring my father's card, said Rubina, 21.My mother raised me after my father abandoned us soon after my birth - how could I furnish his identity papers then?Rubina's frustration drove her to file a petition at the high court in Sindh province, which in November ruled that the government agency that oversees the CNIC must issue her a card based on her mother's citizenship record.For Rubina, the decision meant she could apply to take over her mother's job as an attendant in the state education department when her mother retired.More widely, her case ends the effective exclusion of children of single mothers from the ID card scheme, said Haris Khaleeq, secretary-general of the Human Rights Commission of Pakistan (HRCP), a nonprofit.Without a CNIC, neither can any public service be accessed, nor can any banking transaction be conducted, he told the Thomson Reuters Foundation.In short, one has no rights at all as a citizen.The agency in charge of the CNIC, the National Database and Registration Authority (NADRA), has said it is striving to reach people who have so far been excluded.The government has a clear policy that people who are supposed to be registered in the database will not be excluded, said Salman Sufi, head of the prime minister's Strategic Reforms Unit, which oversees the implementation of federal policy.Established in 2000, NADRA maintains the nation's biometric database, and says it has issued some 120 million CNICs to 96% of adults in the nation of about 212 million people.Each card comprises a 13-digit unique ID, a photograph of the person, their signature, and a microchip that contains their iris scans and fingerprints.Yet millions of people in Pakistan, including women, transgender people, migrant workers and nomadic communities are still without a CNIC.More than 1 billion people globally have no way of proving their identity, according to the World Bank.While governments across the world are adopting digital ID systems they say are improving governance, the U.N. special rapporteur on human rights has said they exclude marginalised groups, and should not be a prerequisite for accessing social protection schemes.A study of migrant workers in Karachi by HRCP last year showed that women were more likely not to have a CNIC, putting them at risk of destitution if their husband died or left the family.Children whose parents are not registered are especially vulnerable, as they cannot get birth certificates, and are at greater risk of trafficking and forced labour, HRCP said.It has recommended more mobile registration units and female staff to help register vulnerable groups, as well as simpler processes and less stringent documentation requirements, which also make it harder for immigrants to apply.Only half of some 2.8 million Afghan refugees who have lived in Pakistan for decades are registered with the government. There is also a sizable population of unregistered Bengali, Nepali, and Rohingya immigrants in Pakistan.A majority of the Bengali-origin Pakistanis do not have CNICs and are living like aliens and illegal migrants in their own country, Sheikh Feroz, a community leader, told a recent rally to demand CNICs.NADRA - which has also helped set up digital ID systems in Bangladesh, Kenya and Nigeria - has said it has a dedicated registration department especially for women, minorities, transgender and unregistered persons.The agency said it had several women-only centres, particularly in border provinces, to overcome the socio-cultural barriers of women hesitating to deal with male staff, and prioritises senior citizens and the disabled.Everyone will be provided an opportunity to get registered. No group based on their ethnicity, race or religion will be excluded, said Sufi, from the Strategic Reforms Unit.For those who have a CNIC, privacy violations are a risk.The CNIC database is accessed by about 300 public and private service providers, from the tax department to the election commission to mobile service providers.There have been several data breaches, which points to inadequate security, said Nighat Dad, a lawyer and executive director at the Digital Rights Foundation, a nonprofit.Women often complain of harassment after their personal information is leaked and is weaponised to blackmail them, she said.Since there is no data protection law, there is no accountability even when personal data such as phone numbers are leaked, she added.Data breaches that expose personal data are particularly risky for vulnerable groups such as journalists, activists and religious and ethnic minorities, said Haroon Baloch, senior programme manager at Bytes for All, a digital rights group.Citizens are not aware of the use of their biometric data, he said. The personal data attached with the biometric IDs can be misused, with serious privacy implications not just for the individual, but also their family.NADRA officials have rejected accusations that the data has been compromised, saying the database has a multi-layer security system which makes hacking impossible.The government will roll out a data privacy policy very soon, said Sufi, with adequate safeguards for data protection, and punishment in case of breach of privacy or data theft.For Rubina, who could not even get a COVID-19 vaccine without a CNIC, simply getting the ID is half the battle won.I am happy that others will not suffer like me, she said."
  },
  {
    "title": "Two PIA planes escape mid-air collision",
    "image": "https://www.geo.tv/assets/uploads/updates/2022-07-26/429767_5673048_updates.jpg",
    "date": " Tuesday Jul 26, 2022 ",
    "data": "Two Pakistan International Airlines planes flying on the same route avoided a mid-air collision in Iranian airspace on Sunday.Both the Pakistani flag carriers were at the same altitude near the United Arab Emirates (UAE) border when they witnessed an extraordinary situation that could have resulted in a major air accident due to the alleged negligence of the Iranian air traffic control (ATC), Daily Dawn reported.The ATC reportedly cleared the altitude for two airliners to fly at the same time.The publication cited sources as saying that a PIA Boeing 777 was en route Dubai from Islamabad while the other, Airbus A320, was flying from Doha to Peshawar, with Captain Athar Haroon and Captain Samiullah in the driving seat.As the two planes came dangerously close to each other, one was directed to dive while the other was asked to go higher in altitude as per standard practice followed in such situations.As per the news article, there is a system on all planes, called Traffic Collision Avoidance System (TCAS), which automatically guides the plane through communication with the TCAS of other aircrafts present nearby.PIA is writing to the Iranian air traffic control (ATC) to investigate as the Iranian ATC instructed the plane, but it was wrong, the publication quoted a PIA spokesman as saying.Giving details, the spokesperson said that PIA flight PK-211, a Boeing 777 from Islamabad to Dubai, was maintaining 35,000-foot altitude when it came close to Peshawar-bound flight PK-268 of Airbus A320 from Doha.PK-268 flight was flying at an altitude of 36,000 feet and was cleared to descend to 20,000 feet, he said, adding that the descent would have come in the flight path of PIA flight of Boeing 777 PK-211, the spokesman added.Meanwhile, the aircrafts TCAS corrected the course for both the planes and automatically guided them, the spokesperson added."
  },
  {
    "title": "Four electrocuted, four drown as heavy rains continue to pound Karachi",
    "image": "",
    "date": " Tuesday Jul 26, 2022 ",
    "data": "KARACHI: Four people, including a father-daughter duo, were electrocuted, while four others drowned due to urban flooding in Karachi on Monday as heavy rains continue to pound the city.One of the tragic incidents took place at a residential apartments' premises on Al-Falah Road in Lyari's Bihar Colony area when a man and his daughter were electrocuted. The rescue teams rushed to the site of the incident and shifted the victims to Civil Hospital, where they were pronounced dead.The deceased were identified as Rehman Usman, 35, and 10-year-old Hifza.Quoting initial reports, police said the incident occurred when Hifza suffered shocks from an electric board in the flat and her father was electrocuted as well as he attempted to save her, The News reported.In another incident in Lyari, an elderly man identified as 60-year-old Salamat Rakha died of electrocution within the limits of the Kalakot police station. The body was shifted to the RPCH.The deceased was a resident of the Baghdadi area of Lyari and he was electrocuted through an electricity pole.Moreover, a dyeing factory worker, Waqar, 25, son of Deedar, died of electrocution at a company located near Habib Bank Chowrangi within the jurisdiction of the SITE A Section police station. The body was shifted to Abbasi Shaheed Hospital for an autopsy.Meanwhile, a 21-year-old youth, Amir, son of Mumtaz, drowned in the Lyari River near Sohrab Goth within the limits of the Federal B Industrial Area police station.Upon receiving the information, rescue workers and police reached the site and started a search operation but could not retrieve the body.Quoting family members and friends of the victim, police said the youths friends had challenged him to cross the river from one side to another but he lost control while trying to complete the challenge and drowned.A video of the incident also went viral on the internet showing how the victim drowned. The search operation was halted due to darkness and it will resume today (Tuesday).A six-year-old boy, Ahmed Ali, son of Hassan, drowned in a pond in the Surjani Town area. Rescue workers retrieved the body and transported it to Abbasi Shaheed Hospital. Police said the boy was bathing in a water-filled pothole near his house when he drowned.In another incident, a teenage girl identified as 15-year-old Sakina, daughter of Ali Murad, drowned in a pothole near the Northern Bypass within the limits of the Mochko police station. She was a resident of the same area.Separately, a teenage boy identified as 17-year-old Bilal, son of Ataur Rehman, drowned in the rainwater in the Clifton area. The body was shifted to the Civil Hospital, Karachi. The deceased teenager was a resident of Keamari.Followed by heavy rain on Sunday in Karachi, more showers on Monday once again wreaked havoc on different parts of the city, incurring losses worth millions of rupees to business owners and ordinary citizens.DHA and Clifton were as usual flooded by rainwater. Khayaban-e-Bukhari, Khayaban-e-Ittehad, Khayaban-e-Nishat, Khayaban-e-Rahat, Khayaban-e-Shujaat, Khayaban-e-Shahbaz and parts of Saba Avenue were completely submerged. In a few DHA phases, rainwater entered peoples homes.Many DHA areas experienced massive power outages as well.We cant go out to get petrol for the generator. Even the gas cylinders are empty now. Living in Karachis posh area is like living in a jungle with no civic amenities at all, said a resident Sidra Qureshi.The heavy rain caused immense hardships for patients and other people who had to step out of their homes despite the announcement of a public holiday on Monday.Amid criticism following the devastating situation in Karachi after the first spell of monsoon downpour, even though the city had received less rain than last year, the city administration acted swiftly this time round, using more manpower and deploying more resources to clear the key road links after hours-long efforts.II Chundrigar Road, Saddar, old city areas, Zainab Market, Lyari and the adjoining areas were completely flooded. After rainwater receded from the Urdu Bazaar, the rubbish and sludge made it impossible for anyone to enter the streets.Jahangir Road, which has been under construction since ages, was completely inundated with sewage-mixed rainwater. The Malir River flooded with rainwater and subsequently, the Korangi Crossing was once again closed for traffic. The adjoining Qayyumabad was also partially blocked, causing a disruption in traffic movement for hours.The Malir Bridge that connects Quaidabad to the Malir 15 area was also partially broken after potholes developed in it, causing a traffic jam for hours.Nagan Chowrangi, Saleem Centre, Power House Chowrangi, Shadman Town, Sakhi Hassan, Five Star and KDA Chowrangi were also flooded. Even after rainwater was drained, the roads were marred by huge ditches. The 4K roundabout area turned into a river with more than knee-deep water, rendering it completely inaccessible for any kind of vehicle.A flood-like situation was witnessed in Surjani Town. After rainwater entered Yusuf Goth and Bismillah Town, law enforcement agencies with the help of the district administration rescued its residents.Karachi Administrator Murtaza Wahab visited the stormwater drains in the Shaheen Complex and provincial assembly area. He said the nullahs were still flowing at full capacity.He kept posting updates on social media about relief and drainage operations. According to him, major roads like Sharea Faisal, MA Jinnah Road, University Road, Shershah Suri Road, Shahrah-e-Pakistan, Rashid Minhas Road, Garden Road, Gizri Road and Hub River Road were cleared by afternoon.Meanwhile, a senior Karachi Water & Sewerage Board official admitted that the situation in the city would take time to normalise.Rainwater is almost drained out from all major roads but its the overflowed sewerage lines in residential areas that have become a challenge, for which we have deployed more resources and hired temporary staff.Many areas were deprived of electricity as soon as rain started. Until the filing of this report, power was yet to be restored to some parts of Gulshan-e-Hadeed, Malir, Landhi and Korangi.The K-Electric spokesperson said that during the break from rain, power is swiftly being restored.Power supply to the city continues to remain stable, and approximately 60 feeders out of 1,900 have been powered down mostly for safety reasons.The spokesperson said that due to waterlogging and illegal connections, some areas may remain powered down as a safety precaution, but as clearance is received, power restoration will be underway.The Pakistan Meteorological Department (PMD) said that many areas of Karachi received very intense rain in the early hours, and it continued for several hours, while in some areas over 100mm of rain was recorded during the spell that caused rainwater to accumulate on main arteries in almost all the districts.Sindh Chief Meteorological Officer Dr Sardar Sarfaraz said that the heaviest spell of the current monsoon system was observed in Mondays early hours, as hours-long showers were caused by the strong cells that had formed over Karachi coupled with the Arabian Seas support.Dr Sarfaraz said that the latest data indicate that Karachi may continue to receive moderate rain with some heavy falls on Tuesday, adding that intermittent rain and showers are also possible on Wednesday because the monsoon system is getting strength from the Arabian Sea.According to PMD data, PAF Base Masroor received the highest amount of rain (204mm) over the past 24 hours, followed by Keamari (188.5mm), Saddar (164mm), Surjani Town (157.3mm), Gulshan-e-Hadeed (154mm), DHA Phase-II (126mm), Quaidabad (111.4mm), Orangi Town (108.5mm), Nazimabad (106mm), Gadap Town (103.6mm), North Karachi (99mm), PAF Base Faisal (88.5mm), Saadi Town (85.1mm), Gulshan-e-Maymar (81.8mm), Old Terminal (81.7mm), University Road (81mm), Korangi (75.7mm) and Jinnah Terminal (65.2mm).Sindh Chief Secretary Dr Muhammad Sohail Rajput said on Monday that shanty dwellings built on storm water drains in old areas of Karachi are the main cause of urban flooding in these neighbourhoods. Visiting different areas, he said the provincial government will sort out the chronic drainage issue.Rajput visited MA Jinnah Road, Shaheen Complex, Jinnah Postgraduate Medical Centre, Garden, Lyari, Five Star Chowrangi, KDA Chowrangi, Sharea Faisal, Gulistan-e-Jauhar, Gulshan-e-Iqbal, Tariq Road, Lyari Expressway, Dr Ruth KM Pfau Civil Hospital Karachi and other localities to inspect the drainage situation. During his visit, the CS was briefed by the deputy commissioners of the East and West districts, and the officials of the Karachi Water & Sewerage Board about rainwater drainage in different areas."
  },
  {
    "title": "Park named after former minister for minority affairs Shahbaz Bhatti in Canada",
    "image": "https://www.geo.tv/assets/uploads/updates/2022-07-26/429752_4793791_updates.jpg",
    "date": " Tuesday Jul 26, 2022 ",
    "data": "Canadian city Brampton Mayor Patrick Brown has named a park after former Pakistani minister for minority affairs Shahbaz Bhatti, who was assassinated in 2011 in the capital, Geo News reported.Brampton Mayor Patrick Brown inaugurated the Shahbaz Bhatti Park and honoured the services of the former Pakistani minister.Proud to officially open Shahbaz Bhatti Park in Brampton. A true symbol of religious freedom. We will never forget Shahbazs legacy, courage and sacrifice, said Patrick Brown while delivering his speech.The administration of Brampton city also paid tribute and lauded the efforts of Shahbaz Bhatti for interfaith harmony.This park honours his legacy, and serves as a reminder of the importance of interfaith harmony, acceptance and inclusivity within communities like Brampton, the city administration said in a statement on Twitter.Shahbaz Bhatti was the first Christian parliamentarian, who made his way to the National Assembly as federal minister in 2008 in PPPs cabinet. However, in 2011 he was shot dead by unknown assailants in Islamabad.Later, TTP (Tehreek-e-Taliban Pakistan) had accepted responsibility of the attack on Shahbaz Bhatti over an alleged blasphemy issue. "
  },
  {
    "title": "PTI berates ruling coalition for boycotting SC hearing on Punjab CM election",
    "image": "",
    "date": " Tuesday Jul 26, 2022 ",
    "data": "Following the ruling coalition's decision to boycott Supreme Courts hearing on the Punjab chief minister's election after the apex court rejected the plea to form a full bench, PTI reacted strongly and berated the ruling alliance for its decision, Geo News reported.Earlier, JUI-F chief Maulana Fazlur Rehman said if the SC doesnt form a full court, we [PDM] will also reject all decisions of the judiciary as we will not appear before this three-member bench.We boycott the proceedings of the apex court, Fazl announced, adding that the coalition government doesn't want any institution to interfere in its matters. During a late-night press conference, PTI Vice President Shah Mahmood Qureshi called it an attack on the judiciary by the executive.Today, Pakistan Democratic Movement (PDM) has attacked the constitution, however, the nation will reject those who have rejected the SCs decision, he said.Qureshi said that sweets were distributed in the country when SC had announced its verdicts in their favour, but now they (PDM) have turned against judges.According to The News, Qureshi said his party was ready to sit with the government if there was an agenda and the only way out of the present vortex was to hold free and transparent elections.We can discuss with them how to hold transparent elections and how to restore the credibility of the Election Commission and what reforms are needed. We have no personal enmity with anyone, he maintained.PTI Secretary General Asad Umar went on to say that the judiciary has been given threats as they (the ruling coalition) are in a state of shock after the court rejected their fake demands.Same three judges were a part of the bench who had given decision against Imran Khans government, however, our leader went out to people as he lived in the hearts of people, he said.On the occasion, a former federal minister and senior PTI leader Ali Zaidi called the ruling coalitions boycott a perfect case of high treason.If the entire sitting government is boycotting the Supreme Court, it is completely a high-treason. What else is this?Ali Zaidi further added that a bunch of bandits are ruling the country and this is the first time that the government is boycotting the judiciary."
  },
  {
    "title": "Pakistan logs 371 fresh COVID cases, one death overnight",
    "image": "https://www.geo.tv/assets/uploads/updates/2022-07-26/429758_1485854_updates.jpg",
    "date": " Tuesday Jul 26, 2022 ",
    "data": "Pakistan logged 371 fresh cases of COVID-19 in the last 24 hours amid a slight countrywide drop in the positivity ratio, the National Institute of Health, Islamabad (NIH) data showed Tuesday morning.As per the latest stats, the new infections were detected after diagnostic testing on 13,439 samples by the national COVID regulating body.After the new additions, Pakistan's COVID-19 case count rose to 1,551,251.However, the country's coronavirus positivity rate dropped to 2.76% within a single day after touching 3%.Meanwhile, Pakistan reported another coronavirus death during the last 24 hours, while 184 others were being treated in critical care units.BA5, part of the Omicron family, is the latest coronavirus variant to cause widespread waves of infection globally.According to the World Health Organisations most recent report, it was behind 52% of cases sequenced in late June, up from 37% in one week. In the United States, it is estimated to be causing around 65% of infections.Rising case numbersBA5 is not new. First identified in January, it has been tracked by the WHO since April.It is a sister variant of the Omicron strain that has been dominant worldwide since the end of 2021 and has already caused spikes in case rates  even with reduced testing  in countries including South Africa, where it was first found, as well as the United Kingdom, parts of Europe, and Australia.Coronavirus cases worldwide have now been rising for four weeks in a row, WHO data showed.Why is it spreading?Like its closely related sibling, BA4, BA5 is particularly good at evading the immune protection afforded either by vaccination or prior infection.For this reason, BA5 has a growth advantage over the other sublineages of Omicron that are circulating, Maria Van Kerkhove, the WHOs technical lead on COVID-19, told a news briefing on Tuesday.For many people, this means that they are getting re-infected, often even a short time after having COVID-19. Van Kerkhove said the WHO is assessing reports of re-infections.We have ample evidence that people whove been infected with Omicron are getting infected with BA5. No question about it, said Gregory Poland, a virologist and vaccine researcher with the Mayo Clinic in Rochester, Minnesota."
  },
  {
    "title": "Meghan Markle 'arrogance' is simply shocking: 'She has fractious relationships'",
    "image": "https://www.geo.tv/assets/uploads/updates/2022-07-26/429757_2514238_updates.jpg",
    "date": " Tuesday Jul 26, 2022 ",
    "data": "Meghan Markle is accused of leaving the royal family for Hollywood and status.Royal commentator Nile Gardiner took to his Twitter to share his thoughts on author Tom Bower's confession of the Duchess of Sussex.The arrogance and hubris on display from Meghan Markle is simply staggering. Meghan Markle left UK for Hollywood because she 'couldn't understand why she wasn't more important'.Speaking to GB News, Mr Bower had said: Meghan is a person who controls the narrative, that has been part of the problem.When she came to London to become part of the Royal Family, she couldnt understand why she wasnt more important and wasnt more in control of everything.And thats why she has fractious relationships with so many people.He added: We know the background and the motivation of a woman who clearly married into the Royal Family because she loved Harry, theres no doubt about that.But also because she loves the status.And very quickly she discovered she wasnt going to get the status of number one which is what she wanted.There is only one number one in the Royal Family, and the rest of the family is there to support the Queen.Meghan didnt understand why she wasnt in the spotlight and very quickly she decided shed be better off in Hollywood, noted the author."
  },
  {
    "title": "Prince Harry 'ghastly' memoir 'ghostwritten' by wife Meghan Markle",
    "image": "",
    "date": " Tuesday Jul 26, 2022 ",
    "data": "Prince Harry's upcoming autobiography is words of Meghan Markle, says royal expert.Earlier this week, The Sun reported the bombshell memoir is written and a finished manuscript has been signed off by lawyers.The manuscript has been finished and gone through all of the legal processes.Its done and out of Harrys hands.The publishing date has been pushed back once.However, it is on track for the end of the year.Responding to the report, foreign policy analyst Nile Gardiner said: This will be ghastly.Much of it probably ghostwritten by Meghan.Prince Harrys tell-all memoir written and likely to be on shelves by Christmas.The Duke's memoir is released in collaboration with Penguin Random. The book was originally rumoured to be out in October."
  },
  {
    "title": "'Poison blooded' Prince Harry 'will not mind' hurting William over memoir: Expert",
    "image": "",
    "date": " Tuesday Jul 26, 2022 ",
    "data": "Prince Harry will not refrain from airing his dirty linen in public in the upcoming memoir, says expert.The Duke of Sussex, eager to show his power against the royals, will not 'spare' his brother William.Speaking to The Mail's Palace Confidential podcast, Angela Levin said that Harry is 'bitter' about his family across the pond and will not hold back from humiliating them.I think he really wants to show his power over William because he was fed up with being the spare rather than the heir, she began.I think hes got a lot of poison running in his blood now about what he feels about his background and his family. And I think he doesnt mind if he hurts people because he feels that he has been hurt by them.Harry's 'intimate' and 'heartfelt' memoir will reportedly be released this Christmas."
  },
  {
    "title": "Meghan Markle 'clearly' married into royals because of 'status': Biographer",
    "image": "",
    "date": " Tuesday Jul 26, 2022 ",
    "data": "Meghan Markle turned her back on the royal family after realising she could not win against Queen and the family.The Duchess of Sussex, who stepped down from her duties as a senior royal in 2020, believed she could be 'number one royal'.Royal biographer Tom Bower tells GB News: We know the background and the motivation of a woman who clearly married into the Royal Family because she loved Harry, but also because she liked the status, he said.And very quickly she discovered that she wasnt going to get the status of number one, which is what she wanted.There is only one number one in the Royal Family, and the rest of the family is there to support the Queen.Meghan didnt understand why she wasnt in the spotlight and very quickly decided she would be better off in Hollywood, Bower claims.The Duchess, who could not understand the hierarchical structure of the royal institution, eventually left for Hollywood with her British husband, adds the expert."
  },
  {
    "title": "Tech giants to self-regulate in reducing harmful content in New Zealand",
    "image": "https://www.geo.tv/assets/uploads/updates/2022-07-26/429749_7991058_updates.jpg",
    "date": " Tuesday Jul 26, 2022 ",
    "data": "WELLINGTON: Big tech companies agreed on Monday to reduce harmful online content in New Zealand, making a move that critics said dodged the alternative of government regulation.Meta Platforms Inc, Alphabet-owned Google, TikTok, Amazon.com Inc and Twitter had signed a code of practice, said Netsafe, a government-funded internet-safety group.The companies would follow the code as self-regulation, Netsafe chief Brent Carey said in a statement.There are too many Kiwis being bullied, harassed, and abused online, which is why the industry has rallied together to protect users, Carey said in a statement.Industry lobby group NZTech will be responsible for the companies meeting obligations, which include reducing harmful content online, reporting how they do that and supporting independent evaluation of results.We hope the governance framework will enable it to evolve alongside local conditions, while at the same time respecting the fundamental rights of freedom of expression, said NZTech chief executive Graeme Muller.Meta and TikTok said in statements they were enthusiastic about the code making online platforms safer and more transparent.Interest groups want more detail, however - for example, about sanctions for any failure by the companies to comply and about a mechanism for public complaints.They also point to the pact being administered by an industry body, not the government.This is a weak attempt to preempt regulation  in New Zealand and overseas  by promoting an industry-led model, Mandy Henk, chief executive of Tohatoha NZ, a non-profit organisation that lobbies on the social impact of technology, said in a statement.The framework that the companies agreed to is called the Aotearoa New Zealand Code of Practice for Online Safety and Harms.New Zealand has been a leader in trying to stamp out violent extremism online. Prime Minister Jacinda Ardern and French President Emmanuel Macron in 2019 launched a global initiative to end online hate."
  },
  {
    "title": "Shakin' bacon? Belgian researchers study pigs' response to music",
    "image": "https://www.geo.tv/assets/uploads/updates/2022-07-26/429748_8903541_updates.jpg",
    "date": " Tuesday Jul 26, 2022 ",
    "data": "BRUSSELS: Scientists in Belgium are investigating a farmer's claim that different styles of music affect the behaviour of his pigs.Piet Paesmans first noticed the phenomenon when his son started singing a tune in the barn during a sluggish insemination session his sows seemed excited and started wagging their tails.I thought this is too good to pass up, we should try that with the other pigs too, Paesmans told Reuters from his farm halfway between Brussels and the Dutch border.He has since created a playlist to coincide with different parts of the day, playing energetic music when he wants the pigs to be active and lullabies at the end of the day.Jolly dance songs are the biggest hits. They really start wagging their tails and when it's really dynamic they even start dancing around and frolicking. Rock music is too strong, they don't like it, Paesmans said.The farmer tipped off a team of researchers who have secured 75,000 euros ($76,770) of financing from an EU fund and the Belgian region of Flanders to investigate the claims.According to project coordinator Sander Palmans, not much is known about pigs' reaction to music but Paesmans' experience chimes with existing knowledge of the effects of sounds in general on animals.There is without a doubt an effect of specific noises on animals. So it's really possible that music can have the same effect, he said, adding that it could help relieve boredom which has been linked to stress.The findings could have practical impacts for the industry as meat quality is affected by stress in animals, Paesmans said.A top athlete needs to be completely fit physically, but also mentally. And that's just the same for pigs. When they are slaughtered, you can see when they've had too much stress ... It's really important for the quality of the meat.The results of the research are expected by the end of the year."
  },
  {
    "title": "Meghan Markle turned arrogant on Suits set after finding Prince Harry ",
    "image": "",
    "date": " Tuesday Jul 26, 2022 ",
    "data": "Meghan Markle reportedly turned arrogant around her Suits co-stars soon after news of her involvement with Prince Harry became public, Tom Bower has claimed in a new book.In his latest bombshell book, Revenge: Meghan, Harry and the War between the Windsors, Bower claimed that not only did the royals start meddling in the shows scripts due to Meghan, the Duchess of Sussexs own mannerisms also changed. Bower wrote: Some actors and staff discovered that Meghans attitude occasionally stiffened. Sometimes she arrived late and her empathy occasionally morphed into near-arrogance.Meghan had markedly shifted from the early days when she held a prayer meeting with the Suits cast before filming started, he further claimed. He also claimed in the book that both Meghan and Harry had been warned against marrying each other ahead of their 2018 nuptials that were watched by millions around the world."
  },
  {
    "title": "Prince William asked uncle to intervene in Harry, Meghans royal wedding",
    "image": "",
    "date": " Tuesday Jul 26, 2022 ",
    "data": "Prince Harry wed Meghan Markle in 2018, however, was reportedly warned against it by not just his brother Prince William, but also his uncle, Earl Spencer, his mother Dianas brother, royal expert Tom Bower claimed.Bower made the claim in his new bombshell book Revenge: Meghan, Harry and the War between the Windsors, saying that not only was Meghan warned against a royal match by her then-talent agent, but Harry was also told to tread with caution. As per Bower, the warning to Prince Harry came from none other than a close relative, his uncle Earl Spencer, through his brother Prince William. Bower wrote: At Williams request, Spencer weighed in. Three times married; Spencer cautioned his nephew to reconsider his haste towards marriage.His advice provoked a bitter reaction. This was going to be really hard, Harry would later reflect on establishing Meghans place in the family, Bower claimed."
  },
  {
    "title": "Prince Harry and Meghan Markle to drop their Royal titles after Duke's memoir?",
    "image": "https://www.geo.tv/assets/uploads/updates/2022-07-25/429739_5909179_updates.jpg",
    "date": " Tuesday Jul 26, 2022 ",
    "data": "There are speculations that Prince Harry and Meghan Markle who stepped down as senior royals in March 2020 and moved to the US, may drop their royal titles after the Duke's upcoming memoir.The Duke and Duchess of Sussex were stripped of their royal patronages and honorary military titles following their bombshell decision.Since leaving the UK the couple has not stepped away from the spotlight, most famously taking part in a controversial interview with Oprah Winfrey in March 2021.Donald Trump previously told Piers Morgan that he thinks the Queen should strip Prince Harry and Meghan Markle of their royal titles, as the Duke and Duchess of Sussex.Several royal experts and fans also demand the monarch to strip of their royal titles as he and Meghan, according to commentators, using them to remain in the spotlight.However, some suggest that the couple may give up or lose their royal tiles after Harry's memoire, which is expected to make shocking revelations about the Royal family.Prince Harry's memoir is expected to be released this year later. There are reports that the manuscript has been finished and gone through all of the legal processes. It's gone and out of Harry's hands."
  },
  {
    "title": "IVE announces comeback date with their new album 'After Like'",
    "image": "https://www.geo.tv/assets/uploads/updates/2022-07-26/429742_5169915_updates.jpg",
    "date": " Tuesday Jul 26, 2022 ",
    "data": "IVE took to Twitter to surprise their fans with an announcement of a comeback in August with the release of their new single album. The announcement was made on July 24, 7:30 pm IST with the first teaser image.It was previously reported that the IVE was preparing to make their comeback in August with their third single album After Like. Following this, IVE officially announced the details of their upcoming album by dropping a teaser image with the name and the details of the album. It is scheduled to be released on Monday, August 8 at 6 pm KST (2:30 pm IST).The girl groups previous single album Love Dive was released on April 5. 2022, marking their first ever comeback. The album broke IVEs past records by becoming the fastest video to reach 100 million views on Youtube.The rookie girl group debuted in December 2021, with the release of their first single album ELEVEN. The band comprises six members, Yujin, Gaeul, Rei, Wonyoung, Liz, and Leeseo. Following their debut, IVE rose to fame immediately, becoming the fastest girl group to win a music show award, doing so in just seven days since their debut."
  },
  {
    "title": "WJSN Exy and Yeoreum test positive for COVID-19",
    "image": "",
    "date": " Tuesday Jul 26, 2022 ",
    "data": "On July 24, Star Entertainment officially announced that WJSN will be halting their promotional activities as members Exy and Yeoreum tested positive for COVID 19. All set to make its first comeback after a year and four months, the cosmic girls were now preparing for their comeback promotions, however, both members are currently suffering from a slight fever and sore throat.Despite other WJSN members testing negative for COVID-19, the group called off their scheduled activities as a precautionary measure including their upcoming appearance on SBSs 'Inkigayo' and a fan signing event.According to the statement released by Star Entertainment, Exy and Yeoreum both have received three doses of their COVID vaccine. At present, they do not show any severe symptoms apart from mild fever and a sore throat. They are currently receiving treatment at home according to the government guidelines.Wishing both Exy and Yeoreum the speediest of recoveries!"
  },
  {
    "title": "Prince Harry and Meghan advised to not bring family problems to public",
    "image": "",
    "date": " Tuesday Jul 26, 2022 ",
    "data": "Prince Harry and his wife Meghan Markle have been told by Sharon Osbourne to keep their family drama out of the public, reported The Daily Record.Sharons comments came during a chat with vocal Sussex critic Piers Morgan on his show Piers Morgan Uncensored, where she said that the royal couple seem lost since moving to the US and that she doesnt agree with them airing their family dirty laundry. I just don't - I haven't from day one been into the fact that talking about private things that went on in the Royal Family when they were a part of it, Sharon said. She added: And the thing is it's just their point of view, we haven't had the other point of view.And it's like don't bring it to the public, no one wants to know about it, every family has problems, keep it to yourself, Sharon further said, before advising both the Duke and Duchess of Sussex to keep some things to themselves."
  },
  {
    "title": "Bushra threatened me to not attend court hearing or I will lose my life: Dania Shah",
    "image": "https://www.geo.tv/assets/uploads/updates/2022-07-25/429737_961741_updates.jpg",
    "date": " Tuesday Jul 26, 2022 ",
    "data": "Dania Shah, the third wife of popular TV host and anchor Aamir Liaquat Hussain, has said that her husband's postmortem should and will take place.Taking to Instagram, Dania said that her husband's former wife Bushra Iqbal was delaying the postmortem, alleging that she was threatening her to not come to the hearing or she will lose her life.Postmortem will and should take place and everything will be cleared. There must be a reason why [Bushra] is delaying the postmortem, said Dania.She went on to say that Bushra was gaining the media's attention and trying to act helpless.Expressing her anger against Bushra, Dania said that she was spreading rumours by using Aamir's phone. You [Bushra] have looted Aamir in the name of your children. Where were you when his video was leaked? she asked.The 18-year-old further said that she has the right to get the postmortem done and she will get the matter investigated."
  },
  {
    "title": "Elon Musk asks followers to list their favourite video games",
    "image": "https://www.geo.tv/assets/uploads/updates/2022-07-25/429740_7574017_updates.jpg",
    "date": " Tuesday Jul 26, 2022 ",
    "data": "The young multi-billionaire, Elon Musk, is fairly active on social media, often making controversial statements or engaging his followers with fun, open-ended questions.Musk took to Twitter earlier today, asking his followers to name their favourite video games from the last two years. One of the most popular answers was Call of Duty Black Ops (COD), with one user saying, only legends know it. The video game series began in 2003 and is set in historical periods of time or unique locations, such as in the midst of the Cold War, futuristic worlds, and outer space.Another favourite was League of Legends, while a user commented Counter Strike forever.In a YouTube video last year with the channel Y Combinator, Musk mentioned that his own favourite video games were Overwatch, Blizzard and Hearthstone.The CEO of Tesla also coded his own video game in 1984 at the age of 12 called Blastar, in which the user tries to dodge attacks on its spaceship. It was published in a magazine and he received $500."
  },
  {
    "title": "Prince Harry slammed for his 'outright criticism of US government'",
    "image": "https://www.geo.tv/assets/uploads/updates/2022-07-25/429734_5120118_updates.jpg",
    "date": " Monday Jul 25, 2022 ",
    "data": "Prince Harry does not seem to pay more respect to his royal protocol as he has sparked a bitter row after making controversial criticisms over the US Supreme Court's decision.Legal and Royal experts have clashed over whether the Duke of Sussex was right to offer his opinion on political matters during his keynote speech to the UN.We all know that royals are not supposed to wade into politics, even though just last week on this show we were speaking about how William has been doing that lately. But Harry is doing it and not subtly at all, Royal commentator Kristen Meinzer said on Newsweek's The Royal Report podcast.Kristen Meinzer slammed the Duke, saying: This is very overt what he is talking about. He is criticizing the United States, what the government has been doingpulling back rights on the people. That is not subtle at all. That is outright criticism of the US government.However, Jack Royston -royal correspondent - disagreed, saying the duke has every right to comment given that his wife and children are Americans.He said: I don't think he ever would have done this if he was a working member of the Royal Family. However, he is out now and so really the royal convention of him not engaging fully in politics doesn't really apply to Meghan and Harry anymore. They have every right to go and say whatever they like about political issues. Here he has taken on a ruling by the US Supreme Court so this is about as controversial as it gets and he's done it at the United Nations.Queen Elizabeth's grandson Prince Harry drew criticism after flaying the US Supreme Court on its ruling to remove constitutional rights to abortion by repealing the landmark Roe v Wade legislation."
  },
  {
    "title": "Keke Palmer claps back at Zendaya's comparison over colourism",
    "image": "https://www.geo.tv/assets/uploads/updates/2022-07-25/429738_7491625_updates.jpg",
    "date": " Monday Jul 25, 2022 ",
    "data": "Keke Palmer recently lashed out at netizens for comparing her career to that of Zendaya.On Saturday, a fan turned to Twitter and shared her thoughts over Hollywoods issue with colourism, which is why, she believed Keke had not reached mainstream popularity like Dune star.I'd like someone to do a deep-drive on the similarities and differences between Keke Palmer and Zendaya's careers. This may be one of the clearest examples of how colorism plays out in Hollywood. They were both child-stars, but their mainstream popularity is very different.On Sunday, the Nope star responded, A great example of colorism is to believe I can be compared to anyone. Im the youngest talk show host ever. The first Black woman to star in her own show on Nickelodeon, & the youngest & first Black Cinderella on Broadway.The Alice actress continued, Ive been a leading lady since I was 11 years old. I have over 100+ credits, and currently starring in an original screenplay thats the number one film at the box office #NOPE. Ive had a blessed career thus far; I couldnt ask for more but God continues to surprise me.Im an incomparable talent. Baby, THIS, is Keke Palmer, she asserted."
  },
  {
    "title": "Scientists discover cancer biomarkers in breast milk",
    "image": "https://www.geo.tv/assets/uploads/updates/2022-07-25/429733_3799609_updates.jpg",
    "date": " Monday Jul 25, 2022 ",
    "data": "A blood test facility for women with breast cancer could soon be available after scientists discovered protein biomarkers in breast milk.The identified biomarkers are for invasive ductal carcinoma (IDC), one of the most common types of breast cancer. However, the researchers say that the test could be used to identify biomarkers for other breast cancers as well.If our future studies are successful, it could change how women are monitored for breast cancer and aid in earlier diagnosis, said lead author Danielle Whitham, a doctoral candidate at Clarkson University, in a statement. This could even lead to a higher survival rate in women.To conduct the study, scientists analysed breast milk samples from three women diagnosed with breast cancer and three women without cancer.The researchers compared levels of certain proteins between the two to identify differences in women with cancer. Their analysis revealed 23 proteins that were dysregulated. All the proteins with differences were found linked to cancer or tumour development.Whitham says that the next step is to confirm their findings in a large-scale study with women. If confirmed, they will then test their protein biomarkers' applicability in blood serum.If those tests are successful, a blood test could be developed to be used on women of any age to monitor protein changes for detection of breast cancer, Whitham said.Whitham will share her research at the American Society for Biochemistry and Molecular Biology annual meeting in Philadelphia in 2022."
  },
  {
    "title": "Women with hijab face job discrimination, study finds strong evidence",
    "image": "https://www.geo.tv/assets/uploads/updates/2022-07-25/429731_8589238_updates.jpg",
    "date": " Monday Jul 25, 2022 ",
    "data": "In a study published in European Sociological Review, researchers conducted a field experiment proving veiled Muslim women face public backlash from clients and customers when job-hunting in Netherlands and Germany.To conduct the study, the researchers picked a set of candidates and filed two job applications for each of them. One was with a hijab, highlighting their religion through volunteering activities at a religious centre, and the other was unveiled with no affiliation to Islam. The job postings required a direct client-customer-based service such as a hairdresser, shop assistant and sales representative.In the Netherlands, in the applications in which no religious affiliation was made, almost 70% of jobs applied had positive feedback. But for applications with hijab-wearing photographs, the positivity rate was 35%.Similarly, in Germany, 53% of unveiled Muslim women received positive feedback from employers, compared to around 25% of callbacks among veiled women. The high level of discrimination we found in the Netherlands, where the institutional context has traditionally been open to the accommodation of religious minority rights, is particularly surprising and points to the possible stigmatising effect of recent policies geared towards the cultural assimilation of immigrants, the researchers noted.However, the level of discrimination in Spain against hijab-wearing women was almost insignificant."
  },
  {
    "title": "International study finds triggers for long COVID in children",
    "image": "https://www.geo.tv/assets/uploads/updates/2022-07-25/429727_1875544_updates.jpg",
    "date": " Monday Jul 25, 2022 ",
    "data": "A new international study found lead causes for long COVID in children aged 14 and over.Those that had multiple COVID-19 symptoms are at higher risk for long virus. The most common symptoms of the virus include fatigue, weakness, cough, difficulty breathing or shortness of breath.We found that in some children, illness with COVID-19 is associated with reporting persistent symptoms after three months, said Stephen Freedman, professor at the University of Calgarys Cumming School of Medicine and co-principal investigator of the study, in a university release.Our results suggest that appropriate guidance and follow-up are needed, especially for children at high risk for long COVID.The study followed up with 1,884 children with COVID with four or more symptoms at the initial emergency department visit. Among them, long COVID was found in nearly 10% of the children and 5% of those discharged from the emergency department. The study was co-led by a team of researchers from UC Davis Health, the University of Calgarys Cumming School of Medicine and Ann & Robert H Lurie Childrens Hospital of Chicago. The study was published in JAMA Network Open."
  },
  {
    "title": "600 minutes of weekly exercise can decrease risk of death, study finds",
    "image": "https://www.geo.tv/assets/uploads/updates/2022-07-25/429729_7182985_updates.jpg",
    "date": " Monday Jul 25, 2022 ",
    "data": "A new study has revealed that working out two to four times a week can reduce the risk of death among adults.Researchers analysed more than 100,000 participants for 30 years and revealed that those who worked out for 150 to 600 minutes had a 21-31% lower mortality rate. The potential impact of physical activity on health is great, yet it remains unclear whether engaging in high levels of prolonged, vigorous or moderate-intensity physical activity above the recommended levels provides any additional benefits or harmful effects on cardiovascular health, says Dong Hoon Lee, ScD, MS, a research associate in the department of nutrition at the Harvard T H Chan School of Public Health in Boston, in a media release.Our study leveraged repeated measures of self-reported physical activity over decades to examine the association between long-term physical activity during middle and late adulthood and mortality.Additionally, the study combated the belief that too much physical activity can be harmful to health and found no harmful cardiovascular health effects among those that engaged in more than the recommended minimum activity levels.Participants self-reported their level of physical activity through a survey every two years. The questions included information about their family medical history, health information, illnesses, and personal habits like alcohol consumption.Our study provides evidence to guide individuals to choose the right amount and intensity of physical activity over their lifetime to maintain their overall health, Lee said.Our findings support the current national physical activity guidelines and further suggest that the maximum benefits may be achieved by performing medium to high levels of either moderate or vigorous activity or a combination.The study is published in the journal Circulation."
  },
  {
    "title": "Ruling coalition boycotts Supreme Court's hearing on Punjab CM's election",
    "image": "https://www.geo.tv/assets/uploads/updates/2022-07-25/429736_2888138_updates.jpg",
    "date": " Monday Jul 25, 2022 ",
    "data": "ISLAMABAD: Following the Supreme Court's decision to continue the hearing on the Punjab chief minister's election with the current three-member bench, the ruling coalition has decided to boycott the hearing scheduled to be held tomorrow, the Pakistan Democratic Movement's (PDM) leadership announced.The Supreme Court of Pakistan Monday rejected the petition seeking the formation of a full bench for hearing the case of the Punjab chief ministers election  where Hamza Shahbaz defeated Pervez Elahi.Addressing a press conference at the Prime Ministers House, JUI-F chief Maulana Fazlur Rehman said if the Supreme Court doesnt form a full court, then we [PDM] will also reject all decisions of the judiciary as we will not appear before this three-member bench.We boycott the proceedings the apex court, Fazl announced, adding that the coalition government doesn't want any institution to interfere in its matters.Fazl, who is also the chief of the PDM, said that the counsellors of the government's alliance advised the jury according to the Constitution. The top court, however, considered our demand impartially and rejected our petition.Speaking on the occasion, Federal Minister for Foreign Affairs and PPP Co-Chairman Bilawal Bhutto-Zardari said that when a decision is being taken about an institution, the entire bench should hear the case.Bilawal, while endorsing Fazls statement, said that the PPP, along with all other alliance parties of the PDM, has decided to boycott the court proceedings.PML-N's senior leader Shahid Khaqan Abbasi said that this was the test of the Supreme Court now. He further added that the PDM had warned if the decision was taken by a full court, only then it would be accepted by the people of Pakistan.Abbasi went on to say that the three judges of the existing bench had the responsibility to decide whether or not history would accept their conduct.It should be noted that adjourning the hearing till 11:30 am tomorrow, the court announced that a three-member bench  headed by Chief Justice Umar Ata Bandial, and comprising Justice Ahsan and Justice Munib Akhtar  will hear the petition filed by the PML-Q and PTI regarding Hamza Shahbaz being elected as the chief minister of Punjab.The press conference followed a huddle of the government leaders at the Prime Minister's House after the verdict was announced.Prime Minister Shehbaz Sharif, Fazl, and Bilawal were among the senior political leaders and government figures in attendance.Leaders of the MQM-P, members of ANP, BAP, BNP and other government-allied parties were also present at the huddle, along with other senior PML-N figures.Earlier, taking to her Twitter account in reaction to the SC's verdict, PML-N Vice President Maryam Nawaz stated that there was only one reason for not forming a full court  fear.Fear of the contradiction of its own decision, PML-N stalwart wrote.Saying that she was almost sure that a full court will not be formed, Maryam added that when decisions arent taken in accordance with the Constitution, law, and justice, then the formation of a full court is deemed dangerous."
  },
  {
    "title": "Gigi Hadid puts her tanned and toned physique on display in body-fitted blue gown",
    "image": "https://www.geo.tv/assets/uploads/updates/2022-07-25/429725_1831837_updates.jpg",
    "date": " Monday Jul 25, 2022 ",
    "data": "Supermodel Gigi Hadid showed off her incredible physique in cut-out panel dress as she stepped out hand-in-hand with influencer friend Leah McCarthy in Saint-Tropez on Sunday.Bella Hadid's sister looked sensational as she slipped her supermodel figure into a daring side slit blue gown. She wore minimal make-up to highlight her natural beauty.Gigi was joined by her pal Leah McCarthy who dazzled in a white ruffled co-ord. The close pals wore their hair in identical plaits as the two stunners enjoyed a night on the town in the French Riviera.Zain Malik's baby mom added a touch of glitz wearing a distinctive gold necklace to accessorise her glam night-time look.Earlier in the day Gigi was seen showcasing her incredible bikini body as she was seen frolicking with the Beckham family on their chartered superyacht in the south of France."
  },
  {
    "title": "Elon Musk rubbishes rumours of dying friendship with Google co-founder",
    "image": "https://www.geo.tv/assets/uploads/updates/2022-07-25/429715_4437011_updates.jpg",
    "date": " Monday Jul 25, 2022 ",
    "data": "Tesla boss andmulti-billionaire Elon Musk rubbished rumours of him ending his friendship withGoogle co-founder Sergey Brin, clappingback at rumours of an affair with Brins wife.Sergey and I are friends and were at a party together last night! Musk wrote on Twitter.He also denied a report that he had been involved in an affair with Brin's wife, Nicole Shanahan.Terming his relationship with Nicole as nothing romantic, Musk said that he met her twice in three years and that too in public.Wall Street Journal reported that Musk had a brief affair with Brins wife, Nicole Shanahan, late last year. Brin filed for divorce earlier this year and allegedly ended his long-time friendship with Musk, according to the paper.However, some sources told WSJ that Musk begged for forgiveness from Brin on one knee after the affair. Although Brin acknowledged Musks attempt at reconciliation, the two still arent speaking regularly.Brin, 48, and Shanahan, 33, separated but continued living together at the time of the affair in December, a source told the publication.Brin told the press that they decided to divorce due to irreconcilable differences."
  },
  {
    "title": "Police arrest man for selling 12-year-old daughter into marriage",
    "image": "https://www.geo.tv/assets/uploads/updates/2022-07-25/429710_7776262_updates.jpg",
    "date": "  Monday Jul 25, 2022 ",
    "data": "JACOBABAD: The police arrested a man for selling off his underage daughter into child marriage.The incident took place in Jacobabad where afather wanted to get his 12-year-old girl married to a man in exchange for Rs300,000.The police prevented the marriage and arrested the father while the groom escaped.According to the police, a case has been registered and further investigation is taking place.It is illegal in Pakistan to marry before the age of 16. Yet, child marriages are prevalent in the country.According to UNICEF, marriage before the age of 18 is a fundamental violation of human rights.Sindh is the only province in Pakistan, which has updated a law passed in 1929 and banned marriages before the age of 18.In Punjab,Child Marriage Restraint Ordinance 1971 has the legal age of marriage at 16 years.In 2016, the Khyber Pakhtunkhwa assembly failed to pass the Khyber Pakhtunkhwa Child Marriage Restraint Bill 2014, which would have raised the age of marriage to 18 years.Balochistan also continues to be governed by the Child Marriage Restraint Act 1929. However, Pakistan ratified the Convention on the Rights of the Child in 1990, according to which the minimum age of marriage is 18 years."
  },
  {
    "title": "Red meat can trigger serious health risks, multiple studies find",
    "image": "https://www.geo.tv/assets/uploads/updates/2022-07-25/429720_2458333_updates.jpg",
    "date": " Monday Jul 25, 2022 ",
    "data": "From an increased risk of stroke to triggering cancer  red meat poses serious health risks, according to a study summary from Study Finds. Red meat and processed foods such as sausage and burgers are linked to diet-related deaths, researchers from Michigan State University revealed.According to the study, 10,000 deaths were traced back to preventable illnesses from food. Many of these deaths were triggered by colon cancer, diabetes, and heart disease.In another shocking study, scientists found genetic evidence proving red and processed meat literally damages DNA and can eventually lead to colorectal cancer.We have known for some time that consumption of processed meat and red meat is a risk factor for colorectal cancer, explained Dr Marios Giannakis, an assistant professor of medicine at Harvard Medical School and a physician at Dana-Farber Cancer Institute.These findings suggest that red meat consumption may cause alkylating damage that leads to cancer-causing mutations in KRAS and PIK3CA, thereby promoting colorectal cancer development. Our data further support red meat intake as a risk factor for colorectal cancer and also provide opportunities to prevent, detect, and treat this disease.Further, researchers discovered that those who regularly consumed processed and red meat were 16% more likely to suffer a stroke. In fact, having one portion of processed meats daily increased the risk by 12%.Researchers from Cornell and Northwestern University found that eating processed meat, red meat and chicken can increase the risk of cardiovascular disease, whereas any meat besides chicken can increase the risk of dying from all causes.However, any changes in diet or concerns about red or processed meat should be discussed with a medical expert before making extreme dietary changes."
  },
  {
    "title": "WATCH: Chess robot breaks 7-year-old opponent's finger during match",
    "image": "https://www.geo.tv/assets/uploads/updates/2022-07-25/429718_1232452_updates.jpg",
    "date": " Monday Jul 25, 2022 ",
    "data": "MOSCOW: A chess robot broke a seven-year-old opponent's finger during the match inthe Moscow Chess Open.The match between the boy and the robot took place last week, according to Sergey Lazarev, who is the president of the Moscow Chess Federation.The robot broke the child's finger. This, of course, is bad, said Lazarev, according to Sky News.The robot was rented by us, it has been exhibited in many places, for a long time, with specialists. The child made a move, and after that, we need to give time for the robot to answer, but the boy hurried, and the robot grabbed him. We have nothing to do with the robot, he added.The video quickly gained popularity on social media which shows the boy's finger being pinched by the robotic arm for a few seconds before a woman and three men rush in to release the boy and lead him away.The child played the very next day, finished the tournament in a cast, and the volunteers helped to record the moves, Lazarev further said.He continued by noting that the Moscow Chess Federation will make an effort to assist the boy's parents, who intended to contact the prosecutor's office."
  }
]
